app/controllers/pages_controller.rb

  def index
    id = session[:user_id]
    @user2 = User.find_by(id: id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]