app/controllers/shipments_controller.rb

  def index
    @shipments = Shipment.all
---
SELECT "shipments".* FROM "shipments"

  def create
    @shipment = Shipment.new(shipment_params)

    respond_to do |format|
      if @shipment.save
---
INSERT INTO "shipments" ("origin", "destination", "price", "sender_mail", "receiver_mail", "cadet_mail", "origin_postal_address", "destination_postal_address", "is_price_estimated", "state", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"

  def set_shipment
    if params[:id].nil? == false
      @shipment = Shipment.find(params[:id])
---
SELECT  "shipments".* FROM "shipments" WHERE "shipments"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]